app/controllers/formularies_controller.rb

  def index
    @formularies = Formulary.all
---
SELECT "formularies".* FROM "formularies"

  def show
    @formulary = Formulary.find_by(id:params[:id])
---
SELECT "formularies".* FROM "formularies" WHERE "formularies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @formulary = Formulary.new(formulary_params)

    if @formulary.save
---
INSERT INTO "formularies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "formulario do postman"], ["created_at", "2021-06-15 19:49:36.526404"], ["updated_at", "2021-06-15 19:49:36.526404"]]

  def update
    @formulary = Formulary.find_by(id:params[:id])
    if @formulary.update(formulary_params)
---
SELECT "formularies".* FROM "formularies" WHERE "formularies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "formularies" SET "name" = $1, "updated_at" = $2 WHERE "formularies"."id" = $3  [["name", "Formulario editado pelo postman"], ["updated_at", "2021-06-15 19:51:39.172667"], ["id", 3]]

  def destroy
    @formulary = Formulary.find_by(id:params[:id])
    @formulary.destroy
---
SELECT "formularies".* FROM "formularies" WHERE "formularies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "formularies" WHERE "formularies"."id" = $1  [["id", 3]]