app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    if @question.save
---
INSERT INTO "questions" ("name", "formulary_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Questão Via Postman"], ["formulary_id", 1], ["created_at", "2021-06-18 13:46:25.089810"], ["updated_at", "2021-06-18 13:46:25.089810"]]

  def update
    if @question.update(question_params)
---
UPDATE "questions" SET "name" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["name", "Questão Alterada pelo postman"], ["updated_at", "2021-06-18 13:47:44.298206"], ["id", 3]]