app/controllers/visits_controller.rb

  def index
    @visits = Visit.all
---
SELECT "visits".* FROM "visits"

  def show
    @visit = Visit.find_by(id:params[:id])
---
SELECT "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @visit = Visit.new(visit_params)

    if @visit.save
---
INSERT INTO "visits" ("date", "user_id", "checkin_at", "checkout_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @visit = Visit.find_by(id:params[:id])

    if @visit.update(visit_params)
---
SELECT "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "visits" SET "status" = $1, "updated_at" = $2 WHERE "visits"."id" = $3  [["status", 2], ["updated_at", "2021-06-15 01:42:40.936475"], ["id", 3]]

  def destroy
    @visit = Visit.find_by(id:params[:id])
    @visit.destroy
---
SELECT "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "visits" WHERE "visits"."id" = $1  [["id", 1]]