app/models/question.rb

  def name_cannot_repeat
    if Question.joins(:formulary).where(name:name).where(formulary_id:formulary_id).present?
---
SELECT "questions".* FROM "questions" INNER JOIN "formularies" ON "formularies"."id" = "questions"."formulary_id" WHERE "questions"."name" = $1 AND "questions"."formulary_id" = $2  [["name", "Questão Nova"], ["formulary_id", 1]]