app/models/visit.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def verify_user#verify if user exists
    if !User.find_by(id:user_id).present?